; domain
(define (domain my_domain)

    (:types
        location
    )

    (:predicates
        (at ?loc - location)            
        (con ?from ?to - location)          ; locations are connected
        (wall ?loc1 ?loc2 - location)       ; wall between locations
        (blocked ?loc - location)           ; location is blocked - agent cannot go there
        (wall-trigger ?trigger ?loc1 ?loc2) ; location is a trigger that creates wall between loc1 and loc2
    )

    (:action move
        :parameters (?from ?to - location)
        :precondition (and (not (blocked ?to)) (or (con ?from ?to) (con ?to ?from)) (at ?from) (not (or (wall ?from ?to) (wall ?to ?from))) )
        :effect (and 
            (at ?to) 
            (not (at ?from))
            (forall (?loc1 ?loc2 - location)
                (when (or (wall-trigger ?to ?loc1 ?loc2) (wall-trigger ?to ?loc2 ?loc1))
                    (and (wall ?loc1 ?loc2) (wall ?loc2 ?loc1))
                )
            )
        )
    )
)

; problem
(define (problem my_problem)

    (:domain my_domain)
    
    (:objects
        a4 b4 c4 d4
        a3 b3 c3 d3
        a2 b2 c2 d2
        a1 b1 c1 d1 - location
    )
    
    (:init 
        (at c1)
        
        (con a4 b4) (con b4 c4) (con c4 d4)
        (con a3 b3) (con b3 c3) (con c3 d3)
        (con a2 b2) (con b2 c2) (con c2 d2)
        (con a1 b1) (con b1 c1) (con c1 d1)
        
        (con a4 a3) (con a3 a2) (con a2 a1)
        (con b4 b3) (con b3 b2) (con b2 b1)
        (con c4 c3) (con c3 c2) (con c2 c1)
        (con d4 d3) (con d3 d2) (con d2 d1)
        
        (blocked b2) (blocked d3) (blocked a4)
        
        (wall c1 c2)
        
        (wall-trigger c2 c2 c3)
    )
    
    (:goal
        (or (at a4) (at b4) (at c4) (at d4))
    )

)

; plan
1. (move c1 b1)
   deleted: (at c1)
   added: (at b1)
   goals met: 0 of 1
2. (move b1 a1)
   deleted: (at b1)
   added: (at a1)
   goals met: 0 of 1
3. (move a1 a2)
   deleted: (at a1)
   added: (at a2)
   goals met: 0 of 1
4. (move a2 a3)
   deleted: (at a2)
   added: (at a3)
   goals met: 0 of 1
5. (move a3 b3)
   deleted: (at a3)
   added: (at b3)
   goals met: 0 of 1
6. (move b3 b4)
   deleted: (at b3)
   added: (at b4)
   goals met: 1 of 1
